Repository: CofficLab/GitOK
Catalog: Packages/GitOKCoreKit/Sources/GitOKCoreKit/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: (%lld) Uncommitted
zh_hans: (%lld) 未提交
zh_hk: (%lld) 未提交

source: /* Empty file */
zh_hans: /* 空文件 */
zh_hk: /* 空檔案 */

source: %lld files
zh_hans: %lld 个文件
zh_hk: %lld 個檔案

source: %lld more conflict files are hidden to keep GitOK responsive
zh_hans: 为保持 GitOK 响应速度，隐藏了另外 %lld 个冲突文件
zh_hk: 為保持 GitOK 回應速度，隱藏了另外 %lld 個衝突檔案

source: %lld remote commits available to pull
zh_hans: %lld 个远程提交可拉取
zh_hk: %lld 個遠端提交可拉取

source: %lld staged files
zh_hans: %lld 个已暂存文件
zh_hk: %lld 個已暫存檔案

source: %lld unstaged files
zh_hans: %lld 个未暂存文件
zh_hk: %lld 個未暫存檔案

source: %lld untracked files will be deleted
zh_hans: %lld 个未跟踪文件将被删除
zh_hk: %lld 個未追蹤檔案將被刪除

source: Abort Merge
zh_hans: 中止合并
zh_hk: 中止合併

# about.general.feature.configurable.description
source: Enable or disable this plugin anytime in Plugin Management.
zh_hans: 可随时在插件管理中启用或停用此插件。
zh_hk: 可隨時在外掛程式管理中啟用或停用此外掛程式。

# about.general.feature.configurable.title
source: Configurable
zh_hans: 可配置
zh_hk: 可設定

# about.general.feature.integration.description
source: Adds %@ capabilities to your Git workflow.
zh_hans: 为 Git 工作流添加 %@ 功能。
zh_hk: 為 Git 工作流程新增 %@ 功能。

# about.general.feature.integration.title
source: GitOK Integration
zh_hans: GitOK 集成
zh_hk: GitOK 整合

# about.general.step.enable
source: Enable %@ in Plugin Management
zh_hans: 在插件管理中启用 %@
zh_hk: 在外掛程式管理中啟用 %@

# about.general.step.register
source: GitOK registers the plugin UI and actions after it is enabled.
zh_hans: 启用后，GitOK 会注册插件的界面和操作。
zh_hk: 啟用後，GitOK 會註冊外掛程式的介面和操作。

# about.general.step.use
source: Open a project and use the plugin from the toolbar, tabs, or status bar.
zh_hans: 打开项目后，从工具栏、标签页或状态栏使用该插件。
zh_hk: 開啟專案後，從工具列、標籤頁或狀態列使用此外掛程式。

# about.general.tip.settings
source: Check related settings if the plugin exposes additional options.
zh_hans: 如果插件提供额外选项，请查看相关设置。
zh_hk: 如果外掛程式提供額外選項，請查看相關設定。

# about.general.tip.toggle
source: You can turn plugins off without uninstalling them.
zh_hans: 可以停用插件而无需卸载。
zh_hk: 可以停用外掛程式而無需解除安裝。

# about.gitTool.feature.configurable.description
source: Toggle this plugin when you want the feature available in your workflow.
zh_hans: 需要该功能时，可在插件管理中开启。
zh_hk: 需要此功能時，可在外掛程式管理中開啟。

# about.gitTool.feature.configurable.title
source: Configurable
zh_hans: 可配置
zh_hk: 可設定

# about.gitTool.feature.workflow.description
source: Extends GitOK with repository operations and Git-focused tools.
zh_hans: 扩展 GitOK 的仓库操作和 Git 工具。
zh_hk: 擴充 GitOK 的儲存庫操作和 Git 工具。

# about.gitTool.feature.workflow.title
source: Git Workflow
zh_hans: Git 工作流
zh_hk: Git 工作流程

# about.gitTool.step.enable
source: Enable %@ in Plugin Management
zh_hans: 在插件管理中启用 %@
zh_hk: 在外掛程式管理中啟用 %@

# about.gitTool.step.openProject
source: Select a Git repository in GitOK.
zh_hans: 在 GitOK 中选择一个 Git 仓库。
zh_hk: 在 GitOK 中選擇一個 Git 儲存庫。

# about.gitTool.step.use
source: Use the plugin from the Git tab, toolbar, or status bar.
zh_hans: 从 Git 标签页、工具栏或状态栏使用该插件。
zh_hk: 從 Git 標籤頁、工具列或狀態列使用此外掛程式。

# about.gitTool.tip.gitState
source: Some tools depend on the current branch, remote, or working tree state.
zh_hans: 部分工具依赖当前分支、远程或工作区状态。
zh_hk: 部分工具依賴目前分支、遠端或工作區狀態。

# about.gitTool.tip.toggle
source: Disable the plugin if you prefer a simpler GitOK layout.
zh_hans: 若希望界面更简洁，可停用此插件。
zh_hk: 若希望介面更簡潔，可停用此外掛程式。

# about.openIn.feature.access.description
source: Opens the current project in an external app from GitOK.
zh_hans: 从 GitOK 用外部应用打开当前项目。
zh_hk: 從 GitOK 用外部應用程式開啟目前專案。

# about.openIn.feature.access.title
source: Quick Launch
zh_hans: 快速启动
zh_hk: 快速啟動

# about.openIn.feature.project.description
source: Uses the selected repository path when launching the external app.
zh_hans: 启动外部应用时使用当前选中的仓库路径。
zh_hk: 啟動外部應用程式時使用目前選中的儲存庫路徑。

# about.openIn.feature.project.title
source: Project Aware
zh_hans: 感知当前项目
zh_hk: 感知目前專案

# about.openIn.footnote.noTerminal
source: No supported terminal app is installed on this Mac.
zh_hans: 此 Mac 未安装受支持的终端应用。
zh_hk: 此 Mac 未安裝受支援的終端機應用程式。

# about.openIn.footnote.notInstalled
source: %@ is not installed on this Mac.
zh_hans: 此 Mac 未安装 %@。
zh_hk: 此 Mac 未安裝 %@。

# about.openIn.step.enable
source: Enable the plugin in Plugin Management.
zh_hans: 在插件管理中启用此插件。
zh_hk: 在外掛程式管理中啟用此外掛程式。

# about.openIn.step.launch
source: Click the toolbar button to open the project in the target app.
zh_hans: 点击工具栏按钮，在目标应用中打开项目。
zh_hk: 點擊工具列按鈕，在目標應用程式中開啟專案。

# about.openIn.step.openProject
source: Select a project in GitOK.
zh_hans: 在 GitOK 中选择项目。
zh_hk: 在 GitOK 中選擇專案。

# about.openIn.tip.installed
source: The target app must be installed on this Mac.
zh_hans: 目标应用必须已安装在此 Mac 上。
zh_hk: 目標應用程式必須已安裝在此 Mac 上。

# about.openIn.tip.path
source: If launch fails, verify the app is installed and the project path is valid.
zh_hans: 若启动失败，请确认应用已安装且项目路径有效。
zh_hk: 若啟動失敗，請確認應用程式已安裝且專案路徑有效。

# about.section.howItWorks
source: How It Works
zh_hans: 如何使用
zh_hk: 如何使用

# about.section.tips
source: Tips
zh_hans: 提示
zh_hk: 提示

# about.statusBar.feature.context.description
source: Updates based on the selected project, branch, or file.
zh_hans: 根据所选项目、分支或文件更新。
zh_hk: 根據所選專案、分支或檔案更新。

# about.statusBar.feature.context.title
source: Context Aware
zh_hans: 上下文感知
zh_hk: 上下文感知

# about.statusBar.feature.display.description
source: Shows useful repository information in the GitOK status bar.
zh_hans: 在 GitOK 状态栏显示有用的仓库信息。
zh_hk: 在 GitOK 狀態列顯示有用的儲存庫資訊。

# about.statusBar.feature.display.title
source: Status Bar
zh_hans: 状态栏
zh_hk: 狀態列

# about.statusBar.step.enable
source: Enable %@ in Plugin Management
zh_hans: 在插件管理中启用 %@
zh_hk: 在外掛程式管理中啟用 %@

# about.statusBar.step.observe
source: Check the status bar for live plugin information.
zh_hans: 在状态栏查看插件的实时信息。
zh_hk: 在狀態列查看外掛程式的即時資訊。

# about.statusBar.step.selectProject
source: Open or select a repository in GitOK.
zh_hans: 在 GitOK 中打开或选择仓库。
zh_hk: 在 GitOK 中開啟或選擇儲存庫。

# about.statusBar.tip.toggle
source: Disable the plugin to hide its status bar item.
zh_hans: 停用插件可隐藏其状态栏条目。
zh_hk: 停用外掛程式可隱藏其狀態列項目。

# about.statusBar.tip.visibility
source: Some status items only appear when a Git repository is active.
zh_hans: 部分状态项仅在 Git 仓库激活时显示。
zh_hk: 部分狀態項目僅在 Git 儲存庫啟用時顯示。

# about.theme.feature.appearance.description
source: Switch themes from appearance settings or the theme status control.
zh_hans: 可从外观设置或主题状态控件切换主题。
zh_hk: 可從外觀設定或主題狀態控制項切換主題。

# about.theme.feature.appearance.title
source: Appearance
zh_hans: 外观
zh_hk: 外觀

# about.theme.feature.palette.description
source: Adds another visual theme to GitOK.
zh_hans: 为 GitOK 增加一种视觉主题。
zh_hk: 為 GitOK 增加一種視覺主題。

# about.theme.feature.palette.title
source: Theme Palette
zh_hans: 主题调色板
zh_hk: 主題調色盤

# about.theme.step.apply
source: Choose this theme to apply its colors across GitOK.
zh_hans: 选择此主题以应用其配色。
zh_hk: 選擇此主題以套用其配色。

# about.theme.step.enable
source: Enable %@ in Plugin Management
zh_hans: 在插件管理中启用 %@
zh_hk: 在外掛程式管理中啟用 %@

# about.theme.step.select
source: Open Appearance settings or the theme picker.
zh_hans: 打开外观设置或主题选择器。
zh_hk: 開啟外觀設定或主題選擇器。

# about.theme.tip.alwaysOn
source: Theme plugins are usually always available once registered.
zh_hans: 主题插件注册后通常始终可用。
zh_hk: 主題外掛程式註冊後通常始終可用。

# about.theme.tip.combine
source: You can combine themes with light/dark mode settings.
zh_hans: 可将主题与浅色/深色模式设置组合使用。
zh_hk: 可將主題與淺色/深色模式設定組合使用。

source: After
zh_hans: 之后
zh_hk: 之後

source: After undoing, the file changes from this commit will be kept in the working directory for re-editing and committing.
zh_hans: 撤销后，此提交的文件更改将保留在工作目录中，可重新编辑并提交。
zh_hk: 復原後，此提交的檔案變更將保留在工作目錄中，可重新編輯並提交。

source: All Changes Committed
zh_hans: 所有更改已提交
zh_hk: 所有變更已提交

source: All conflicts resolved
zh_hans: 所有冲突已解决
zh_hk: 所有衝突已解決

source: Are you sure you want to discard all changes? This will affect %@. This action cannot be undone.
zh_hans: 确定要丢弃所有更改吗？这会影响 %@。此操作无法撤销。
zh_hk: 確定要捨棄所有變更嗎？這會影響 %@。此操作無法復原。

source: Are you sure you want to discard changes for %@? This action cannot be undone.
zh_hans: 确定要丢弃 %@ 的更改吗？此操作无法撤销。
zh_hk: 確定要捨棄 %@ 的變更嗎？此操作無法復原。

source: Are you sure you want to discard changes for %@? This untracked file will be deleted. This action cannot be undone.
zh_hans: 确定要丢弃 %@ 的更改吗？这个未跟踪文件将被删除。此操作无法撤销。
zh_hk: 確定要捨棄 %@ 的變更嗎？這個未追蹤檔案將被刪除。此操作無法復原。

source: Are you sure you want to discard changes for %lld files? %lld untracked files will be deleted. This action cannot be undone.
zh_hans: 确定要丢弃 %lld 个文件的更改吗？其中 %lld 个未跟踪文件将被删除。此操作无法撤销。
zh_hk: 確定要捨棄 %lld 個檔案的變更嗎？其中 %lld 個未追蹤檔案將被刪除。此操作無法復原。

source: Are you sure you want to discard changes for %lld files? This action cannot be undone.
zh_hans: 确定要丢弃 %lld 个文件的更改吗？此操作无法撤销。
zh_hk: 確定要捨棄 %lld 個檔案的變更嗎？此操作無法復原。

source: Before
zh_hans: 之前
zh_hk: 之前

source: Binary File
zh_hans: 二进制文件
zh_hk: 二進位檔案

source: Branch is up to date, click Fetch to check for remote updates
zh_hans: 分支已是最新，点击获取以检查远程更新
zh_hk: 分支已是最新，點擊取得以檢查遠端更新

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Changes
zh_hans: 变更
zh_hk: 變更

source: Changes Pending
zh_hans: 有未提交的更改
zh_hk: 有未提交的變更

source: Choose a side
zh_hans: 选择一方
zh_hk: 選擇一方

source: Clear current batch selection
zh_hans: 清除当前批量选择
zh_hk: 清除當前批量選擇

source: Clear Selection
zh_hans: 清除选择
zh_hk: 清除選擇

source: Click to push to remote
zh_hans: 点击推送到远程
zh_hk: 點擊推送到遠端

source: Click to view user info
zh_hans: 点击查看用户信息
zh_hk: 點擊檢視使用者資訊

source: Commit message cannot be empty
zh_hans: 提交信息不能为空
zh_hk: 提交訊息不能為空

source: Commits ready to push
zh_hans: 有提交可推送
zh_hk: 有提交可推送

source: Complete the merge
zh_hans: 完成合并
zh_hk: 完成合併

source: Confirm Delete Remote Tag?
zh_hans: 确认删除远程标签？
zh_hk: 確認刪除遠端標籤？

source: Confirm Delete Tag?
zh_hans: 确认删除标签？
zh_hk: 確認刪除標籤？

source: Confirm Discard All Changes
zh_hans: 确认丢弃所有更改
zh_hk: 確認捨棄所有變更

source: Confirm Discard File Changes
zh_hans: 确认丢弃文件更改
zh_hk: 確認捨棄檔案變更

source: Confirm Discard Selected Changes
zh_hans: 确认丢弃所选更改
zh_hk: 確認捨棄所選變更

source: Confirm Hard Reset?
zh_hans: 确认硬重置？
zh_hk: 確認硬重置？

source: Confirm Mixed Reset?
zh_hans: 确认混合重置？
zh_hk: 確認混合重置？

source: Confirm Revert This Commit?
zh_hans: 确认还原此提交？
zh_hk: 確認還原此提交？

source: Confirm Soft Reset?
zh_hans: 确认软重置？
zh_hk: 確認軟重置？

source: Confirm Squash Commits?
zh_hans: 确认压缩提交？
zh_hk: 確認壓縮提交？

source: Confirm Undo Commit?
zh_hans: 确认撤销提交？
zh_hk: 確認復原提交？

source: Continue Merge
zh_hans: 继续合并
zh_hk: 繼續合併

source: Copied
zh_hans: 已复制
zh_hk: 已複製

source: Copy Raw Diff
zh_hans: 复制原始差异
zh_hk: 複製原始差異

source: Copy Reason
zh_hans: 复制原因
zh_hk: 複製原因

source: Create
zh_hans: 创建
zh_hk: 建立

source: Create a lightweight tag for commit %@.
zh_hans: 为提交 %@ 创建轻量标签。
zh_hk: 為提交 %@ 建立輕量標籤。

source: Create an annotated tag for commit %@.
zh_hans: 为提交 %@ 创建附注标签。
zh_hk: 為提交 %@ 建立附註標籤。

source: Create Annotated Tag
zh_hans: 创建附注标签
zh_hk: 建立附註標籤

source: Create Tag
zh_hans: 创建标签
zh_hk: 建立標籤

source: Current commit has not been pushed to remote
zh_hans: 当前提交尚未推送到远程
zh_hk: 目前提交尚未推送到遠端

source: Delete
zh_hans: 删除
zh_hk: 刪除

source: Delete Remote Tag
zh_hans: 删除远程标签
zh_hk: 刪除遠端標籤

source: Delete Tag
zh_hans: 删除标签
zh_hk: 刪除標籤

source: Deleted
zh_hans: 已删除
zh_hk: 已刪除

source: Deleted Image
zh_hans: 已删除图像
zh_hk: 已刪除圖像

source: Diff data could not be generated. You can check whether the file still exists, verify it is text-encoded, or refresh the current view.
zh_hans: 无法生成差异数据。您可以检查文件是否仍然存在、验证其是否为文本编码，或刷新当前视图。
zh_hk: 無法產生差異資料。您可以檢查檔案是否仍然存在、驗證其是否為文字編碼，或重新整理當前視圖。

source: Diff is too large, rendering skipped
zh_hans: 差异太大，已跳过渲染
zh_hk: 差異太大，已跳過渲染

source: Difference
zh_hans: 差异
zh_hk: 差異

source: Differences cannot be shown as text for this file
zh_hans: 此文件的差异无法以文本形式显示
zh_hk: 此檔案的差異無法以文字形式顯示

source: Discard
zh_hans: 丢弃
zh_hk: 捨棄

source: Discard All
zh_hans: 全部丢弃
zh_hk: 全部捨棄

source: Discard All Changes
zh_hans: 丢弃所有更改
zh_hk: 捨棄所有變更

source: Discard changes of all files
zh_hans: 丢弃所有文件的更改
zh_hk: 捨棄所有檔案的變更

source: Discard changes of files in the batch selection
zh_hans: 丢弃批量选择中文件的更改
zh_hk: 捨棄批次選取中檔案的變更

source: Discard File
zh_hans: 丢弃文件
zh_hk: 捨棄檔案

source: Discard Selected
zh_hans: 丢弃所选
zh_hk: 捨棄所選

source: Discarded all file changes
zh_hans: 已丢弃所有文件更改
zh_hk: 已捨棄所有檔案變更

source: Discarded changes for %lld files
zh_hans: 已丢弃 %lld 个文件的更改
zh_hk: 已捨棄 %lld 個檔案的變更

source: Discarded file changes: %@
zh_hans: 已丢弃文件更改：%@
zh_hk: 已捨棄檔案變更：%@

source: Fetch origin
zh_hans: 获取 origin
zh_hk: 取得 origin

source: Fetching
zh_hans: 获取中
zh_hk: 取得中

source: files
zh_hans: 个文件
zh_hk: 個檔案

source: Filter files
zh_hans: 筛选文件
zh_hk: 篩選檔案

source: GitOK will create a new reverse commit to undo the changes. Suitable for pushed commits. If there are conflicts, resolve them manually before continuing.
zh_hans: GitOK 将创建一个新的反向提交来撤销更改。适用于已推送的提交。如有冲突，请手动解决后再继续。
zh_hk: GitOK 將建立一個新的反向提交來復原變更。適用於已推送的提交。如有衝突，請手動解決後再繼續。

source: Hard Reset
zh_hans: 硬重置
zh_hk: 硬重置

source: HEAD will move to this commit. Changes from subsequent commits will be preserved in the staging area.
zh_hans: HEAD 将移动到此提交。后续提交的更改将保留在暂存区中。
zh_hk: HEAD 將移動到此提交。後續提交的變更將保留在暫存區中。

source: HEAD will move to this commit. Changes from subsequent commits will be preserved in the working directory but unstaged.
zh_hans: HEAD 将移动到此提交。后续提交的更改将保留在工作目录中但取消暂存。
zh_hk: HEAD 將移動到此提交。後續提交的變更將保留在工作目錄中但取消暫存。

source: HEAD, staging area, and working directory will all revert to this commit. Local commits and uncommitted changes after this commit will be discarded.
zh_hans: HEAD、暂存区和工作目录都将恢复到此提交。此提交之后的本地提交和未提交更改将被丢弃。
zh_hk: HEAD、暫存區和工作目錄都將還原到此提交。此提交之後的本地提交和未提交變更將被丟棄。

source: History Files
zh_hans: 历史文件
zh_hk: 歷史檔案

source: Image Comparison
zh_hans: 图像对比
zh_hk: 圖像對比

source: Image Comparison Mode
zh_hans: 图像对比模式
zh_hk: 圖像對比模式

source: Image difference blend comparison
zh_hans: 图像差异混合对比
zh_hk: 圖像差異混合對比

source: Image overlay comparison
zh_hans: 图像叠加对比
zh_hk: 圖像疊加對比

source: Image preview skipped because the file is \(sizeMB) MB, exceeding the \(maxMB) MB preview limit.
zh_hans: 文件为 \(sizeMB) MB，超过 \(maxMB) MB 预览限制，已跳过图像预览。
zh_hk: 檔案為 \(sizeMB) MB，超過 \(maxMB) MB 預覽限制，已跳過圖像預覽。

source: Image side-by-side comparison
zh_hans: 图像并排对比
zh_hk: 圖像並排對比

source: Image swipe comparison
zh_hans: 图像滑动对比
zh_hk: 圖像滑動對比

source: Loading...
zh_hans: 加载中...
zh_hk: 載入中...

source: Mark resolved and stage
zh_hans: 标记为已解决并暂存
zh_hk: 標記為已解決並暫存

source: Merge is ready to complete
zh_hans: 合并已就绪，可以完成
zh_hk: 合併已就緒，可以完成

source: Merge is waiting for resolution
zh_hans: 合并等待解决冲突
zh_hk: 合併等待解決衝突

source: Merging
zh_hans: 合并中
zh_hk: 合併中

source: Mixed Reset
zh_hans: 混合重置
zh_hk: 混合重置

source: Modified
zh_hans: 已修改
zh_hk: 已修改

source: Modified image opacity
zh_hans: 修改图像不透明度
zh_hk: 修改圖像不透明度

source: New commits on remote
zh_hans: 远程有新提交
zh_hk: 遠端有新提交

source: New commits on remote, click Pull; Fetch or Push available in menu
zh_hans: 远程有新提交，点击拉取；获取或推送可在菜单中使用
zh_hk: 遠端有新提交，點擊拉取；取得或推送可在選單中使用

source: New Image
zh_hans: 新图像
zh_hk: 新圖像

source: New Text
zh_hans: 新文本
zh_hk: 新文字

source: No differences to display
zh_hans: 无差异可显示
zh_hk: 無差異可顯示

source: No displayable patch was retrieved for this deleted file. Common causes include an empty file or Git not returning a deletion diff. You can still view the text before deletion.
zh_hans: 未能检索到此已删除文件的可显示补丁。常见原因包括空文件或 Git 未返回删除差异。您仍可查看删除前的文本。
zh_hk: 未能檢索到此已刪除檔案的可顯示補丁。常見原因包括空檔案或 Git 未返回刪除差異。您仍可檢視刪除前的文字。

source: No files changed
zh_hans: 无文件变更
zh_hk: 無檔案變更

source: No matching files
zh_hans: 无匹配文件
zh_hk: 無匹配檔案

source: No parseable text diff was generated for this new file. Common causes include an empty file, non-text content, or Git not returning a patch. You can still view the new text directly.
zh_hans: 未为此新文件生成可解析的文本差异。常见原因包括空文件、非文本内容或 Git 未返回补丁。您仍可直接查看新文本。
zh_hk: 未為此新檔案產生可解析的文字差異。常見原因包括空檔案、非文字內容或 Git 未返回補丁。您仍可直接檢視新文字。

source: No text differences to display for this file. It may be unchanged, empty, or the diff output is empty. You can view the original and new text directly to confirm.
zh_hans: 此文件无文本差异可显示。可能文件未更改、为空或差异输出为空。您可以直接查看原始和新文本来确认。
zh_hk: 此檔案無文字差異可顯示。可能檔案未更改、為空或差異輸出為空。您可以直接檢視原始和新文字來確認。

source: Open in editor
zh_hans: 在编辑器中打开
zh_hk: 在編輯器中打開

source: Original Text
zh_hans: 原始文本
zh_hk: 原始文字

source: Overlay
zh_hans: 叠加
zh_hk: 疊加

source: Project unavailable
zh_hans: 项目不可用
zh_hk: 專案不可用

source: Publish branch
zh_hans: 发布分支
zh_hk: 發佈分支

source: Pull origin
zh_hans: 拉取 origin
zh_hk: 拉取 origin

source: Push
zh_hans: 推送
zh_hk: 推送

source: Push failed: \(error.localizedDescription)
zh_hans: 推送失败：\(error.localizedDescription)
zh_hk: 推送失敗：\(error.localizedDescription)

source: Push origin
zh_hans: 推送 origin
zh_hk: 推送 origin

source: Push Tag
zh_hans: 推送标签
zh_hk: 推送標籤

source: Push to Remote
zh_hans: 推送到远程
zh_hk: 推送到遠端

source: Pushing...
zh_hans: 推送中…
zh_hk: 推送中…

source: Ready to stage
zh_hans: 可暂存
zh_hk: 可暫存

source: Refresh
zh_hans: 刷新
zh_hk: 重新整理

source: Remote tag deleted: %@
zh_hans: 远程标签已删除：%@
zh_hk: 遠端標籤已刪除：%@

source: Renamed
zh_hans: 已重命名
zh_hk: 已重新命名

source: Reset to Here
zh_hans: 重置到此处
zh_hk: 重置到此處

source: Reset to: \(shortHash(hash)) (\(mode))
zh_hans: 重置到：\(shortHash(hash)) (\(mode))
zh_hk: 重置到：\(shortHash(hash)) (\(mode))

source: Resolve all conflicts before continuing
zh_hans: 继续前请解决所有冲突
zh_hk: 繼續前請解決所有衝突

source: Resolve merge conflicts
zh_hans: 解决合并冲突
zh_hk: 解決合併衝突

source: Retry
zh_hans: 重试
zh_hk: 重試

source: Reveal in Finder
zh_hans: 在访达中显示
zh_hk: 在 Finder 中顯示

source: Revert This Commit
zh_hans: 还原此提交
zh_hk: 還原此提交

source: Reverted: \(shortHash(hash))
zh_hans: 已还原：\(shortHash(hash))
zh_hk: 已還原：\(shortHash(hash))

source: Select All Current
zh_hans: 选择当前全部
zh_hk: 選擇當前全部

source: Select all files in the current filter result
zh_hans: 选择当前筛选结果中的所有文件
zh_hk: 選擇當前篩選結果中的所有檔案

source: Selected
zh_hans: 已选择
zh_hk: 已選擇

source: Showing first %lld conflict files
zh_hans: 显示前 %lld 个冲突文件
zh_hk: 顯示前 %lld 個衝突檔案

source: Shows the before and after images side by side
zh_hans: 并排显示修改前后的图像
zh_hk: 並排顯示修改前後的圖像

source: Side by Side
zh_hans: 并排对比
zh_hk: 並排對比

source: Soft Reset
zh_hans: 软重置
zh_hk: 軟重置

source: Squash commit message
zh_hans: 压缩提交信息
zh_hk: 壓縮提交訊息

source: Squash to Here
zh_hans: 压缩到此处
zh_hk: 壓縮到此處

source: Squashed \(count) commits
zh_hans: 已压缩 \(count) 个提交
zh_hk: 已壓縮 \(count) 個提交

source: Stage
zh_hans: 暂存
zh_hk: 暫存

source: Stage files that can still be staged in the batch selection
zh_hans: 暂存批量选择中仍可暂存的文件
zh_hk: 暫存批量選擇中仍可暫存的檔案

source: Stage resolved file
zh_hans: 暂存已解决的文件
zh_hk: 暫存已解決的檔案

source: Stage resolved files before continuing
zh_hans: 继续前请暂存已解决的文件
zh_hk: 繼續前請暫存已解決的檔案

source: Staged
zh_hans: 已暂存
zh_hk: 已暫存

source: Staged \(count) files
zh_hans: 已暂存 \(count) 个文件
zh_hk: 已暫存 \(count) 個檔案

source: Staged Changes
zh_hans: 已暂存的变更
zh_hk: 已暫存的變更

source: Staged New
zh_hans: 已暂存的新文件
zh_hk: 已暫存的新檔案

source: Staged: \(path)
zh_hans: 已暂存：\(path)
zh_hk: 已暫存：\(path)

source: Swipe
zh_hans: 滑动
zh_hk: 滑動

source: Swipe divider position
zh_hans: 滑动分割线位置
zh_hk: 滑動分割線位置

source: Tag created: %@
zh_hans: 标签已创建：%@
zh_hk: 標籤已建立：%@

source: Tag deleted: %@
zh_hans: 标签已删除：%@
zh_hk: 標籤已刪除：%@

source: Tag Message
zh_hans: 标签信息
zh_hk: 標籤訊息

source: Tag message cannot be empty
zh_hans: 标签信息不能为空
zh_hk: 標籤訊息不能為空

source: Tag Name
zh_hans: 标签名称
zh_hk: 標籤名稱

source: Tag name cannot be empty
zh_hans: 标签名称不能为空
zh_hk: 標籤名稱不能為空

source: Tag pushed: %@
zh_hans: 标签已推送：%@
zh_hk: 標籤已推送：%@

source: The current diff is approximately \(characterCount.formatted()) characters. To avoid UI lag, GitOK does not render oversized patches directly; you can still copy the raw diff or view the file text.
zh_hans: 当前差异约 \(characterCount.formatted()) 个字符。为避免界面卡顿，GitOK 不直接渲染过大的补丁；您仍可复制原始差异或查看文件文本。
zh_hk: 當前差異約 \(characterCount.formatted()) 個字元。為避免介面卡頓，GitOK 不直接渲染過大的補丁；您仍可複製原始差異或檢視檔案文字。

source: This will combine \(commitIndex + 1) commits from HEAD to this commit into one. Only recommended for unpushed commits.
zh_hans: 这将从 HEAD 到此提交的 \(commitIndex + 1) 个提交合并为一个。仅建议用于未推送的提交。
zh_hk: 這將從 HEAD 到此提交的 \(commitIndex + 1) 個提交合併為一個。僅建議用於未推送的提交。

source: This will delete the local tag %@. Remote tags will not be affected.
zh_hans: 这将删除本地标签 %@。远程标签不受影响。
zh_hk: 這將刪除本地標籤 %@。遠端標籤不受影響。

source: This will delete the tag %@ on origin. Local tags will not be affected.
zh_hans: 这将删除 origin 上的标签 %@。本地标签不受影响。
zh_hk: 這將刪除 origin 上的標籤 %@。本地標籤不受影響。

source: Type Changed
zh_hans: 类型已更改
zh_hk: 類型已更改

source: Unable to display differences
zh_hans: 无法显示差异
zh_hk: 無法顯示差異

source: Unable to load \(versionLabel) text: \(errorDescription)
zh_hans: 无法加载 \(versionLabel) 文本：\(errorDescription)
zh_hk: 無法載入 \(versionLabel) 文字：\(errorDescription)

source: Unable to load image
zh_hans: 无法加载图像
zh_hk: 無法載入圖像

source: Undo
zh_hans: 撤销
zh_hk: 復原

source: Undo Commit
zh_hans: 撤销提交
zh_hk: 復原提交

source: Undo this commit
zh_hans: 撤销此提交
zh_hk: 復原此提交

source: Undoing the initial commit is not supported
zh_hans: 不支持撤销初始提交
zh_hk: 不支援復原初始提交

source: Unknown
zh_hans: 未知
zh_hk: 未知

source: Unresolved
zh_hans: 未解决
zh_hk: 未解決

source: Unstage
zh_hans: 取消暂存
zh_hk: 取消暫存

source: Unstage already staged files in the batch selection
zh_hans: 取消暂存批量选择中已暂存的文件
zh_hk: 取消暫存批量選擇中已暫存的檔案

source: Unstaged \(count) files
zh_hans: 已取消暂存 \(count) 个文件
zh_hk: 已取消暫存 \(count) 個檔案

source: Unstaged: \(path)
zh_hans: 已取消暂存：\(path)
zh_hk: 已取消暫存：\(path)

source: Untracked New
zh_hans: 未跟踪的新文件
zh_hk: 未追蹤的新檔案

source: Use Ours
zh_hans: 使用 ours
zh_hk: 使用 ours

source: Use the slider to adjust the opacity of the modified image overlaid on the original
zh_hans: 使用滑块调整修改图像叠加在原图上的不透明度
zh_hk: 使用滑塊調整修改圖像疊加在原圖上的不透明度

source: Use the slider to adjust the position where the modified image overlays the original
zh_hans: 使用滑块调整修改图像叠加在原图上的位置
zh_hk: 使用滑塊調整修改圖像疊加在原圖上的位置

source: Use Theirs
zh_hans: 使用 theirs
zh_hk: 使用 theirs

source: Uses difference blend mode to highlight areas where the two images differ
zh_hans: 使用差异混合模式突出显示两张图像不同的区域
zh_hk: 使用差異混合模式突顯兩張圖像不同的區域

source: View New Text
zh_hans: 查看新文本
zh_hk: 檢視新文字

source: View Original Text
zh_hans: 查看原始文本
zh_hk: 檢視原始文字

source: Working Tree Clean
zh_hans: 工作区干净
zh_hk: 工作區乾淨

# 推送中…
source: Pushing…
zh_hans: 推送中…
zh_hk: 推送中…

# 提交中…
source: Committing…
zh_hans: 提交中…
zh_hk: 提交中…

# 提交并推送成功
source: Committed and pushed successfully
zh_hans: 提交并推送成功
zh_hk: 提交並推送成功

# 提交成功
source: Committed successfully
zh_hans: 提交成功
zh_hk: 提交成功

# 添加文件中…
source: Adding files…
zh_hans: 添加文件中…
zh_hk: 添加檔案中…

source: Emoji Style
zh_hans: Emoji 风格
zh_hk: Emoji 風格

source: Plain Style
zh_hans: 纯文本风格
zh_hk: 純文本風格

source: Lowercase Style
zh_hans: 纯文本小写
zh_hk: 純文本小寫
